class Settings():
    """Класс для хранения настроек"""

    def __init__(self):
        """Инициализирует настройки"""
        # Настройки экрана
        self.screen_width = 1024
        self.screen_height = 768
        self.screen_color = (255, 255, 255)

        # Флаг для решения
        self.solving_active = False

        # Рассматриваемая судоку
        self.bg_color = (255, 255, 255)
        self.sudoku = [
            [5, 3, 0, 0, 7, 0, 0, 0, 0],
            [6, 0, 0, 1, 9, 5, 0, 0, 0],
            [0, 9, 8, 0, 0, 0, 0, 6, 0],
            [8, 0, 0, 0, 6, 0, 0, 0, 3],
            [4, 0, 0, 8, 0, 3, 0, 0, 1],
            [7, 0, 0, 0, 2, 0, 0, 0, 6],
            [0, 6, 0, 0, 0, 0, 2, 8, 0],
            [0, 0, 0, 4, 1, 9, 0, 0, 5],
            [0, 0, 0, 0, 8, 0, 0, 7, 9],
        ]
